
#+TITLE:ivan hanigan github website 
#+AUTHOR: Ivan Hanigan
#+email: ivan.hanigan@anu.edu.au
#+LaTeX_CLASS: article
#+LaTeX_CLASS_OPTIONS: [a4paper]
#+LATEX: \tableofcontents
-----

**** COMMENT pioz_modelling-code
#+name:pioz_modelling
#+begin_src R :session *R* :tangle no :exports none :eval yes
    ################################################################
    # name:pioz_modelling
    require(disentangle)
    nodes <- newnode("data", "variable selection/transformation", newgraph = T)
    nodes  <- newnode("model building dataset (75%)",
                      inputs = "data"
                      )
    nodes  <- newnode("validation dataset (25%)", "data")
    nodes  <- newnode("OLS","model building dataset (75%)")
  #  nodes  <- newnode("diagnostics", "OLS")
    nodes  <- newnode("semi-variogram of the OLS residuals", "OLS", c("200km radius"))
    nodes <- newnode("inverse distance weighting", "assumption")
    nodes  <- newnode("spatial lag model", c("200km radius", "inverse distance weighting"))
    nodes  <- newnode("spatial error model",  c("200km radius", "inverse distance weighting", "robust Lagrange Multiplier"))
    nodes <- newnode("robust Lagrange Multiplier", c("spatial lag model", "spatial error model"))
    nodes <- newnode("three thematic sets of variables", "variable selection/transformation")
    nodes <- newnode("AIC to select variables", c("spatial error model", "three thematic sets of variables"), "minimal model")
  
    nodes <- newnode("compare dir, magnt and sig", c("OLS", "minimal model"))
    nodes <- newnode("coefficient of determination","literature several pseudo-R2 have")
    nodes <- newnode("assess fit", c("minimal model","RMSE", "coefficient of determination"))
    nodes <- newnode("assess fit with validation dataset", c("validation dataset (25%)", "RMSE", "coefficient of determination"))
    nodes <- newnode("assess each covariate",  "minimal model", "LR tests, loop drop-one-test-repeat")
    nodes <- newnode("compare the OLS and spatial error results for variables", c("OLS", "LR tests, loop drop-one-test-repeat"))
    dev.copy(png,"images/pioz_modelling.png", height = 1000, width = 700, res = 105)
    dev.off(); dev.off()
#+end_src

#+RESULTS: pioz_modelling
: 1

    
